Revit 2024 API
KeyBasedTreeEntriesIterator Class
 An iterator to a set of KeyBasedTreeEntry objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class KeyBasedTreeEntriesIterator : IEnumerator<KeyBasedTreeEntry>
Visual Basic
Public Class KeyBasedTreeEntriesIterator _
	Implements IEnumerator(Of KeyBasedTreeEntry)
Visual C++
public ref class KeyBasedTreeEntriesIterator : IEnumerator<KeyBasedTreeEntry^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntriesIterator
See Also
KeyBasedTreeEntriesIterator Members
Autodesk.Revit.DB Namespace